""" Приложение Task Manager
    =============================================================
        консольное приложение - менеджер управления заметок,
        пользователь может создать заметку, редактировать,
        посмотреть все заметки или удалить выбранную.
    =============================================================
    ~~~~~~~~~~~~~~~~~~~~~
    | version app 0.0.8 |
    ~~~~~~~~~~~~~~~~~~~~~

    v(0.0.1)
    разработан цикл приложения - структурное программирование

    v(0.0.2)
    внедрен  i/o функционал для ввода задачи

    v(0.0.3)
    разработаны функции для цикла - функциональное программирование

    v(0.0.4)
    добавлены проверки и подтверждения

    v(0.0.5)
    созданы методы сохранения и загрузки - файловые сохранения

    v(0.0.6)
    созданы методы для удаления, редактирования и создания задач - логика вынесена из цикла

    v(0.0.7)
    основной цикл помещен в отдельный метод - def main

    v(0.0.8)
    реализован функционал добавления контента задачи - имя + содержание

    v(0.0.9)
    обновили отображение колекции

    v(0.1.0)
    создать модули и сделать review code

"""
from app import app

def main():
    print("Я устал работать спаси меня это я компьютер!")
    app()

if __name__ == '__main__':
    main()
